bank_app/app/controllers/offices_controller.rb

  def index
    @offices = Office.all
---
SELECT "offices".* FROM "offices"

  def show
    @office = Office.find(params[:id])
---
SELECT "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @office = Office.new(office_params)

    if @office.save
---
INSERT INTO "offices" ("name", "address", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Calle 45"], ["address", "Calle 45 entre 8 y 9 , La Plata"], ["phone", "2213245698"], ["created_at", "2022-11-21 16:49:01.971793"], ["updated_at", "2022-11-21 16:49:01.971793"]]

  def edit
    @office = Office.find(params[:id])
---
SELECT "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @office = Office.find(params[:id])
---
SELECT "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def destroy
    @office = Office.find(params[:office_id])
    office_can_be_deleted?(@office)

    @office.destroy
---
SELECT "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "offices" WHERE "offices"."id" = ?  [["id", 3]]