bank_app/app/controllers/schedules_controller.rb

    def edit
     @office = Office.find(params[:office_id])
     @schedule = @office.schedules.find(params[:id])
---
SELECT "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "schedules".* FROM "schedules" WHERE "schedules"."office_id" = ? AND "schedules"."id" = ? LIMIT ?  [["office_id", 1], ["id", 1], ["LIMIT", 1]]