bank_app/app/controllers/schedules_controller.rb

SELECT "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "schedules" ("days", "start_at", "end_at", "office_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        @office = Office.find(params[:office_id])
        @schedule = @office.schedules.create(schedule_params)

SELECT "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "schedules".* FROM "schedules" WHERE "schedules"."office_id" = ? AND "schedules"."id" = ? LIMIT ?  [["office_id", 1], ["id", 2], ["LIMIT", 1]]
DELETE FROM "schedules" WHERE "schedules"."id" = ?  [["id", 2]]
---
    def destroy
        @office = Office.find(params[:office_id])
        @schedule = @office.schedules.find(params[:id])
        @schedule.destroy

SELECT "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def index
      @office = Office.find(params[:office_id])